import { IRandomActivityData } from '../types/toolTypes'

const randomActivity: IRandomActivityData[] = [
  {
    type: 1,
    name: [
      'KTV聚会',
      '同学会',
      '东湖骑行',
      '抓娃娃团聚集地',
      '吃饭',
      '广场舞',
      'impact',
      'KtV',
      '冲冲冲',
      'gogogo',
      '光谷广场',
      '武昌梦时代'
    ]
  },
  {
    type: 2,
    name: [
      '桌游',
      '网吧',
      '密室',
      '麻将',
      '雀魂',
      '轰趴',
      '三国杀',
      '扑克',
      'gogogo',
      '润',
      '光谷密室',
      '群光',
      '彩六线下交流赛',
      '雀魂线下赛',
      '电玩'
    ]
  },
  {
    type: 3,
    name: ['KTV', '琴台', '音乐节', '流行音乐', 'ACG', '说唱', '国风']
  },
  {
    type: 4,
    name: [
      '乒乓球',
      '台球',
      '羽毛球',
      '509篮球友谊赛',
      '足球友谊赛',
      '网球',
      '中南民族大学足球友谊赛'
    ]
  },
  {
    type: 5,
    name: [
      '考研讲座',
      'ai交流会',
      '考研学习室',
      '知识竞赛',
      '图书馆',
      '509读书会'
    ]
  },
  {
    type: 7,
    name: ['考研讲座', '人工智能交流会', '.NET开发者交流讲座']
  },
  {
    type: 8,
    name: [
      '求一辆二手自行车',
      '求数据结构的教材',
      '寻狗启示',
      '一杯水',
      '求一辆二手车',
      '求大三的教材',
      '求二手笔记本',
      '求一二手平板',
      '求人',
      '寻猫',
      '求队友',
      '求一辆二手自行车',
      '求一辆二手自行车',
      '租借女友'
    ]
  }
]

export default randomActivity
